html/org-pages/qc/week6.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-02-24 Thu 20:35 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Week 6 - my notes</title>
<meta name="author" content="Luís Spengler" />
<meta name="description" content="Week 6 - my notes" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://luispengler.github.io/site/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://luispengler.github.io/site/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Week 6 - my notes</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgf054fa5">Week 6 (qubit by qubit)</a>
<ul>
<li><a href="#org3bcabcd">Recap</a></li>
<li><a href="#org3890a91">Math for Quantum: Qubits</a></li>
<li><a href="#org2758d94">Phase</a></li>
<li><a href="#orgccfa371">Lab</a></li>
<li><a href="#orgd6e4ecb">Resources</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgf054fa5" class="outline-2">
<h2 id="orgf054fa5">Week 6 (qubit by qubit)</h2>
<div class="outline-text-2" id="text-orgf054fa5">
</div>
<div id="outline-container-org3bcabcd" class="outline-3">
<h3 id="org3bcabcd">Recap</h3>
<div class="outline-text-3" id="text-org3bcabcd">
</div>
<div id="outline-container-org55ebd3a" class="outline-4">
<h4 id="org55ebd3a">Review: States and Gates</h4>
<div class="outline-text-4" id="text-org55ebd3a">
<ul class="org-ul">
<li>X - 180 rotation around the X-axis</li>
<li>Z - 180 rotation around the Z-axis</li>
<li>H - creates a superposition</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org3890a91" class="outline-3">
<h3 id="org3890a91">Math for Quantum: Qubits</h3>
<div class="outline-text-3" id="text-org3890a91">
<ul class="org-ul">
<li>With math we can predict the outcomes, without necessarily having to memorize each one of them.</li>
<li><b>Superconducting</b>, <b>Trapped Ions</b>, <b>Diamond NV Centers</b>, <b>Photonics</b> are different kind of qubits, and math is the language common to all of them!</li>
<li><b>Linear Algebra</b> is used in many algorithms, like grover&rsquo;s algorithm.</li>
</ul>
</div>

<div id="outline-container-org7ef70fd" class="outline-4">
<h4 id="org7ef70fd">Qubits</h4>
<div class="outline-text-4" id="text-org7ef70fd">
<ul class="org-ul">
<li>\(|0\rangle\), \(|1\rangle\), \(|+\rangle\), \(|-\rangle\) are ways to represent them.</li>
<li><b>But</b> in an unequal superposition, we need a better way to represent contributions.</li>
<li>That is why we will use <b>two numbers in the form of a vector.</b></li>
<li>0 state is represented as \[\begin{bmatrix}1\\0\end{bmatrix}\]</li>
<li>1 state is represented as \[\begin{bmatrix}0\\1\end{bmatrix}\]</li>
<li>It is worth mentioning that the top number represents the component of \(|0\rangle\) and the bottom, the component of \(|1\rangle\).</li>
</ul>
\begin{bmatrix} |0\rangle\ component\\|1\rangle\ component\end{bmatrix}
</div>
</div>

<div id="outline-container-orgb6d6773" class="outline-4">
<h4 id="orgb6d6773">Superpostions</h4>
<div class="outline-text-4" id="text-orgb6d6773">
<ul class="org-ul">
<li>To represent equal superpositions, we just need to add the two vectors:
\[\begin{bmatrix}1\\0\end{bmatrix} + \begin{bmatrix}0\\1\end{bmatrix} = \begin{bmatrix}1\\1\end{bmatrix}\]</li>

<li>To get to an unequal superposition, we need to apply some gates to get there and this is the goal of a field called quantum algorithm design</li>
</ul>
</div>
</div>

<div id="outline-container-orgc1954f4" class="outline-4">
<h4 id="orgc1954f4">Normalization</h4>
<div class="outline-text-4" id="text-orgc1954f4">
<ul class="org-ul">
<li>The vectors representing quantum states must be <b>normalized</b>, which means they have a <b>lenght of 1</b></li>
<li>The radius of the Bloch Sphere is 1, so as all quantum states lie on the Bloch sphere, they must all have a length of 1.</li>

<li class="off"><code>[&#xa0;]</code> Step 1: Write the state in the vector form \[\begin{bmatrix}a\\b\end{bmatrix}\]</li>
<li class="off"><code>[&#xa0;]</code> Step 2: Find the length of the state as \[\sqrt{a^2 + b^2}\]</li>
<li class="off"><code>[&#xa0;]</code> Step 3: If the length is 1, the state is normalized. If not, divide the state by its length to get the normalized state.
<ul class="org-ul">
<li>Normalized form of the state = \[\frac{1}{\sqrt{a^2 + b^2}}\begin{bmatrix}a\\b\end{bmatrix}\]</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org5da675e" class="outline-4">
<h4 id="org5da675e">Examples to help with normalization:</h4>
<div class="outline-text-4" id="text-org5da675e">
<ul class="org-ul">
<li>Remember that all of this comes from <b>linear algebra</b></li>
<li>The length of the state \[\begin{bmatrix}1\\0\end{bmatrix}\]
<ul class="org-ul">
<li>A: 1</li>
</ul></li>
<li>Find the normalized state of \[\begin{bmatrix}1\\1\end{bmatrix}\]
<ul class="org-ul">
<li>Finding the length: \[\sqrt{1^2 + 1^2} = \sqrt{2}\]</li>
<li>As the length is not 1, we need to divide take the state and divide it by its length, then we get the normalized state:</li>
</ul></li>
</ul>
<p>
\[\frac{1}{\sqrt{2}}\begin{bmatrix}1\\1\end{bmatrix}\]
</p>
</div>
</div>
</div>

<div id="outline-container-org2758d94" class="outline-3">
<h3 id="org2758d94">Phase</h3>
<div class="outline-text-3" id="text-org2758d94">
<ul class="org-ul">
<li>Subtract the following states:
\[\frac{1}{\sqrt{2}}\begin{bmatrix}1\\0\end{bmatrix} - \frac{1}{\sqrt{2}}\begin{bmatrix}0\\1\end{bmatrix} = \frac{1}{\sqrt{2}}\begin{bmatrix}1\\-1\end{bmatrix}\]</li>
<li>That is the same as \(|-\rangle\)</li>
</ul>
</div>
<div id="outline-container-org580eefc" class="outline-4">
<h4 id="org580eefc">Normalized form of \(|+\rangle\) and \(|-\rangle\) states</h4>
<div class="outline-text-4" id="text-org580eefc">
<ul class="org-ul">
<li>\(|+\rangle\) = \[\frac{1}{\sqrt{2}}(|0\rangle+|1\rangle)\] same as \[\frac{1}{\sqrt{2}}\begin{bmatrix}1\\1\end{bmatrix}\]</li>
<li>\(|-\rangle\) = \[\\frac{1}{\sqrt{2}}(|0\rangle-|1\rangle)\] same as \[\frac{1}{\sqrt{2}}\begin{bmatrix}1\\-1\end{bmatrix}\]</li>
<li>These two states above are both equal superpositions but they differ in <b>phase</b></li>
<li>Therefore, the sign between \(|0\rangle\) and \(|1\rangle\) is called phase. <b>Is it positive or negative?</b></li>
<li>The phase diferences lead to interference (more coming soon)</li>
<li>There are more relations in phase that won&rsquo;t be addressed in this course because they require <b>complex numbers</b></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgccfa371" class="outline-3">
<h3 id="orgccfa371">Lab</h3>
<div class="outline-text-3" id="text-orgccfa371">
<ul class="org-ul">
<li>Qiskit Aer, Qiskit Nature, Qiskit Pulse are what we have inside the mega qiskit library. We are gonna use Qiskit Aer.
<ul class="org-ul">
<li>Qiskit Aer has two simulators: the Statevector simulator and the QASM simulator</li>
</ul></li>
<li>The Statevector simulator gives us the vector form of the final state. It gives us the <b>ideal result</b></li>
<li>The QASM simulator gives us the performing measurements on quantum circuits (like a hands-on)</li>
<li>We can say statevector will give us the theorical result and QASM simulator will give us the experimental result.</li>
</ul>
</div>
</div>

<div id="outline-container-orgd6e4ecb" class="outline-3">
<h3 id="orgd6e4ecb">Resources</h3>
<div class="outline-text-3" id="text-orgd6e4ecb">
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=fNk_zzaMoSs&amp;list=PLZHQObOWTQDPD3MizzM2xVFitgF8hE_ab">Essence of Linear Algebra: A Video Playlist by 3Blue1Brown</a>
<ul class="org-ul">
<li>Summary: Explains all important concepts in linear algebra visually in a geometric way. Very highly recommended!</li>
</ul></li>
<li><a href="https://www.youtube.com/playlist?list=PLZHQObOWTQDP5CVelJJ1bNDouqrAhVPev">Lockdown Math: A Video Playlist by 3Blue1Brown</a>
<ul class="org-ul">
<li>Summary:  Important math concepts presented in a visual manner. Multiple episodes on complex numbers which are very highly recommended!</li>
</ul></li>
<li><a href="https://medium.com/@jeremyjkun/here-s-just-a-fraction-of-what-you-can-do-with-linear-algebra-633383d4153f">Here’s just a fraction of what you can do with linear algebra, Jeremy Kun (Article)</a>
<ul class="org-ul">
<li>Summary: Why should we be motivated to learn the math needed for this course and computer science as a whole?  A quick read on some applications of linear algebra.</li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Luís Spengler</p>
<p class="date">Created: 2022-02-24 Thu 20:35</p>
</div>
</body>
</html>
